foxbrokenleaf/ESP32-edp/Project/STM32F10x_StdPeriph_Template/MDK-ARM/Drivers/EPD.c
#include "EPD.h"
#include "EPD_Data.h"
#include <string.h>
#include <math.h>
#include <stdio.h>
#include <stdarg.h>
#include "stm32f10x.h"

/**
  * 数据存储格式：
  * 纵向8点，高位在下，先从左到右，再从上到下
  * 每一个Bit对应一个像素点
  * 
  * 坐标轴定义：
  * 左上角为(0, 0)点
  * 横向向右为X轴，取值范围：0~151
  * 纵向向下为Y轴，取值范围：0~295
  */

/*全局变量*********************/
uint8_t EPD_DisplayBuf[EPD_HEIGHT][EPD_COLUMN_BYTES];

/*引脚定义（根据实际硬件连接修改）*********************/
#define EPD_BUSY_PORT   GPIOA
#define EPD_BUSY_PIN    GPIO_Pin_5
#define EPD_RST_PORT    GPIOA
#define EPD_RST_PIN     GPIO_Pin_4
#define EPD_DC_PORT     GPIOA
#define EPD_DC_PIN      GPIO_Pin_3
#define EPD_CS_PORT     GPIOA
#define EPD_CS_PIN      GPIO_Pin_2
#define EPD_SCL_PORT    GPIOA
#define EPD_SCL_PIN     GPIO_Pin_1
#define EPD_SDA_PORT    GPIOA
#define EPD_SDA_PIN     GPIO_Pin_0

/*引脚操作宏*********************/
#define EPD_BUSY_READ()      GPIO_ReadInputDataBit(EPD_BUSY_PORT, EPD_BUSY_PIN)
#define EPD_RST_HIGH()       GPIO_SetBits(EPD_RST_PORT, EPD_RST_PIN)
#define EPD_RST_LOW()        GPIO_ResetBits(EPD_RST_PORT, EPD_RST_PIN)
#define EPD_DC_HIGH()        GPIO_SetBits(EPD_DC_PORT, EPD_DC_PIN)
#define EPD_DC_LOW()         GPIO_ResetBits(EPD_DC_PORT, EPD_DC_PIN)
#define EPD_CS_HIGH()        GPIO_SetBits(EPD_CS_PORT, EPD_CS_PIN)
#define EPD_CS_LOW()         GPIO_ResetBits(EPD_CS_PORT, EPD_CS_PIN)
#define EPD_SCL_HIGH()       GPIO_SetBits(EPD_SCL_PORT, EPD_SCL_PIN)
#define EPD_SCL_LOW()        GPIO_ResetBits(EPD_SCL_PORT, EPD_SCL_PIN)
#define EPD_SDA_HIGH()       GPIO_SetBits(EPD_SDA_PORT, EPD_SDA_PIN)
#define EPD_SDA_LOW()        GPIO_ResetBits(EPD_SDA_PORT, EPD_SDA_PIN)

/*延时函数*********************/
static void delay_ms(uint32_t ms)
{
    uint32_t i;
    while(ms--)
    {
        for(i = 0; i < 8000; i++);
    }
}

static void delay_us(uint32_t us)
{
    uint32_t i;
    while(us--)
    {
        for(i = 0; i < 8; i++);
    }
}

/*工具函数*********************/
static uint32_t EPD_Pow(uint32_t X, uint32_t Y)
{
    uint32_t Result = 1;
    while(Y--)
    {
        Result *= X;
    }
    return Result;
}

static uint8_t EPD_pnpoly(uint8_t nvert, int16_t *vertx, int16_t *verty, int16_t testx, int16_t testy)
{
    int16_t i, j, c = 0;
    
    for (i = 0, j = nvert - 1; i < nvert; j = i++)
    {
        if (((verty[i] > testy) != (verty[j] > testy)) &&
            (testx < (vertx[j] - vertx[i]) * (testy - verty[i]) / (verty[j] - verty[i]) + vertx[i]))
        {
            c = !c;
        }
    }
    return c;
}

static uint8_t EPD_IsInAngle(int16_t X, int16_t Y, int16_t StartAngle, int16_t EndAngle)
{
    int16_t PointAngle;
    PointAngle = atan2(Y, X) / 3.14 * 180;
    if (StartAngle < EndAngle)
    {
        if (PointAngle >= StartAngle && PointAngle <= EndAngle)
        {
            return 1;
        }
    }
    else
    {
        if (PointAngle >= StartAngle || PointAngle <= EndAngle)
        {
            return 1;
        }
    }
    return 0;
}

/*引脚配置*********************/
void EPD_W_SCL(uint8_t BitValue)
{
    if(BitValue)
        EPD_SCL_HIGH();
    else
        EPD_SCL_LOW();
}

void EPD_W_SDA(uint8_t BitValue)
{
    if(BitValue)
        EPD_SDA_HIGH();
    else
        EPD_SDA_LOW();
}

void EPD_GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;
    uint32_t i, j;
    
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    
    GPIO_InitStructure.GPIO_Pin = EPD_BUSY_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_Init(EPD_BUSY_PORT, &GPIO_InitStructure);
    
    GPIO_InitStructure.GPIO_Pin = EPD_RST_PIN | EPD_DC_PIN | EPD_CS_PIN | 
                                  EPD_SCL_PIN | EPD_SDA_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(EPD_RST_PORT, &GPIO_InitStructure);
    
    for (i = 0; i < 1000; i ++)
    {
        for (j = 0; j < 1000; j ++);
    }
    
    EPD_RST_HIGH();
    EPD_DC_HIGH();
    EPD_CS_HIGH();
    EPD_SCL_HIGH();
    EPD_SDA_HIGH();
}

/*通信协议*********************/
void EPD_SPI_SendByte(uint8_t Byte)
{
    uint8_t i;
    
    for(i = 0; i < 8; i++)
    {
        EPD_W_SCL(0);
        EPD_W_SDA(!!(Byte & (0x80 >> i)));
        delay_us(1);
        EPD_W_SCL(1);
        delay_us(1);
        EPD_W_SCL(0);
    }
}

void EPD_WriteCommand(uint8_t Command)
{
    EPD_CS_LOW();
    EPD_DC_LOW();
    EPD_SPI_SendByte(Command);
    EPD_CS_HIGH();
}

void EPD_WriteData(uint8_t Data)
{
    EPD_CS_LOW();
    EPD_DC_HIGH();
    EPD_SPI_SendByte(Data);
    EPD_CS_HIGH();
}

void EPD_BUSY_Wait(void)
{
    while(EPD_BUSY_READ() != Bit_SET)
    {
        delay_ms(10);
    }
}

/*硬件配置*********************/
void EPD_COG_Reset(void)
{
    delay_ms(5);
    EPD_RST_HIGH();
    delay_ms(5);
    EPD_RST_LOW();
    delay_ms(10);
    EPD_RST_HIGH();
    delay_ms(5);
    EPD_CS_HIGH();
    delay_ms(5);
}

/**
  * 2.66inch屏幕初始化序列（基于官方代码）
  */
void EPD_Init(void)
{
    EPD_GPIO_Init();
    EPD_COG_Reset();
    
    /* 软复位 */
    EPD_WriteCommand(EPD_CMD_SOFT_RESET);
    EPD_WriteData(0xE0);
    delay_ms(5);
    
    /* Power Setting */
    EPD_WriteCommand(EPD_CMD_PWR);
    EPD_WriteData(0x3F);  // VDS_EN, VDG_EN, VCOM_HV, VGHL_LV[1], VGHL_LV[0]
    EPD_WriteData(0x00);  // VDH and VDL
    EPD_WriteData(0x32);  // VDHR
    EPD_WriteData(0x2A);  // VCOM Voltage
    EPD_WriteData(0x0E);  // VGHL_LV
    EPD_WriteData(0x2A);  // VGHL_LV
    
    /* Booster Soft Start */
    EPD_WriteCommand(EPD_CMD_BTST);
    EPD_WriteData(0x17);
    EPD_WriteData(0x17);
    EPD_WriteData(0x17);
    
    /* Power Sequence */
    EPD_WriteCommand(EPD_CMD_PWR_SEQ);
    EPD_WriteData(0x41);
    EPD_WriteData(0x00);
    EPD_WriteData(0x32);
    
    /* PLL Control */
    EPD_WriteCommand(EPD_CMD_PLL);
    EPD_WriteData(0x3C);
    
    /* Temperature Sensor Enable */
    EPD_WriteCommand(EPD_CMD_TSE);
    EPD_WriteData(0x00);
    
    /* Panel Setting */
    EPD_WriteCommand(EPD_CMD_PSR);
    EPD_WriteData(0xCF);  // 152x296, LUT from OTP
    EPD_WriteData(0x8D);  // 选择默认LUT
    
    /* VCOM and Data Interval */
    EPD_WriteCommand(EPD_CMD_CDI);
    EPD_WriteData(0x97);  // VCOM设置
    
    /* 设置温度 */
    EPD_WriteCommand(EPD_CMD_WRITE_TEMPERATURE);
    EPD_WriteData(0x19);  // 25°C
    
    EPD_WriteCommand(EPD_CMD_APPLY_TEMPERATURE);
    EPD_WriteData(0x02);
    
    EPD_Clear();
}

/*功能函数*********************/
/**
  * 函    数：将EPD显存数组更新到EPD屏幕
  * 参    数：无
  * 返 回 值：无
  * 注：对于墨水屏，0x00表示黑色，0xFF表示白色
  */
void EPD_Update(void)
{
    uint16_t i, j;
    
    /* 写入黑白图像数据 */
    EPD_WriteCommand(EPD_CMD_WRITE_IMAGE_RAM_BW);
    for(i = 0; i < EPD_HEIGHT; i++)
    {
        for(j = 0; j < EPD_COLUMN_BYTES; j++)
        {
            /* 显存中0表示黑色，1表示白色 */
            EPD_WriteData(EPD_DisplayBuf[i][j]);
        }
    }
    
    /* 红色通道全0（不使用红色） */
    EPD_WriteCommand(EPD_CMD_WRITE_IMAGE_RAM_RW);
    for(i = 0; i < EPD_HEIGHT; i++)
    {
        for(j = 0; j < EPD_COLUMN_BYTES; j++)
        {
            EPD_WriteData(0x00);
        }
    }
    
    /* 刷新显示 */
    EPD_WriteCommand(EPD_CMD_POWER_ON);
    delay_ms(5);
    EPD_BUSY_Wait();
    
    EPD_WriteCommand(EPD_CMD_DISPLAY_REFRESH);
    delay_ms(5);
    EPD_BUSY_Wait();
    
    EPD_WriteCommand(EPD_CMD_POWER_OFF);
    EPD_BUSY_Wait();
}

void EPD_UpdateArea(int16_t X, int16_t Y, uint16_t Width, uint16_t Height)
{
    EPD_Update();
}

/**
  * 函    数：将EPD显存数组全部清零（设置为黑色？还是白色？）
  * 注：根据您的描述，应该是设置为白色（背景）
  * 参    数：无
  * 返 回 值：无
  */
void EPD_Clear(void)
{
    uint16_t i, j;
    for(i = 0; i < EPD_HEIGHT; i++)
    {
        for(j = 0; j < EPD_COLUMN_BYTES; j++)
        {
            EPD_DisplayBuf[i][j] = 0xFF;  // 0xFF表示全部为1（白色）
        }
    }
}

/**
  * 函    数：将EPD显存数组部分清零（设置为白色）
  * 参    数：X 指定区域左上角的横坐标
  * 参    数：Y 指定区域左上角的纵坐标
  * 参    数：Width 指定区域的宽度
  * 参    数：Height 指定区域的高度
  * 返 回 值：无
  */
void EPD_ClearArea(int16_t X, int16_t Y, uint16_t Width, uint16_t Height)
{
    int16_t i, j;
    uint8_t byteIndex, bitIndex;
    
    for(j = Y; j < Y + Height; j++)
    {
        for(i = X; i < X + Width; i++)
        {
            if(i >= 0 && i < EPD_WIDTH && j >= 0 && j < EPD_HEIGHT)
            {
                byteIndex = i / 8;
                bitIndex = 7 - (i % 8);
                EPD_DisplayBuf[j][byteIndex] |= (0x01 << bitIndex);  // 设置为1（白色）
            }
        }
    }
}

/**
  * 函    数：将EPD显存数组全部取反（黑白反转）
  * 参    数：无
  * 返 回 值：无
  */
void EPD_Reverse(void)
{
    uint16_t i, j;
    for(i = 0; i < EPD_HEIGHT; i++)
    {
        for(j = 0; j < EPD_COLUMN_BYTES; j++)
        {
            EPD_DisplayBuf[i][j] ^= 0xFF;  // 取反
        }
    }
}

/**
  * 函    数：将EPD显存数组部分取反（黑白反转）
  * 参    数：X 指定区域左上角的横坐标
  * 参    数：Y 指定区域左上角的纵坐标
  * 参    数：Width 指定区域的宽度
  * 参    数：Height 指定区域的高度
  * 返 回 值：无
  */
void EPD_ReverseArea(int16_t X, int16_t Y, uint16_t Width, uint16_t Height)
{
    int16_t i, j;
    uint8_t byteIndex, bitIndex;
    
    for(j = Y; j < Y + Height; j++)
    {
        for(i = X; i < X + Width; i++)
        {
            if(i >= 0 && i < EPD_WIDTH && j >= 0 && j < EPD_HEIGHT)
            {
                byteIndex = i / 8;
                bitIndex = 7 - (i % 8);
                EPD_DisplayBuf[j][byteIndex] ^= (0x01 << bitIndex);  // 单个位取反
            }
        }
    }
}

/**
  * 函    数：EPD显示一个字符（黑色前景，白色背景）
  * 参    数：X 指定字符左上角的横坐标
  * 参    数：Y 指定字符左上角的纵坐标
  * 参    数：Char 指定要显示的字符
  * 参    数：FontSize 指定字体大小
  *           范围：EPD_8X16		宽8像素，高16像素
  *                 EPD_6X8		宽6像素，高8像素
  * 返 回 值：无
  */
void EPD_ShowChar(int16_t X, int16_t Y, char Char, uint8_t FontSize)
{
    uint8_t i, j;
    uint8_t temp;
    uint8_t pos;
    uint8_t byteIndex, bitIndex;
    
