foxbrokenleaf/ESP32-edp/Project/STM32F10x_StdPeriph_Template/MDK-ARM/Drivers/EPD.c
    if(FontSize == EPD_8X16)
    {
        /* 8x16字体，每个字符16字节，每字节代表一列8个像素 */
        pos = Char - ' ';  // 计算字符在字库中的位置
        
        for(i = 0; i < 16; i++)  // 16行（高度）
        {
            temp = EPD_F8x16[pos][i];  // 获取一行数据
            
            for(j = 0; j < 8; j++)  // 8列（宽度）
            {
                if(X + j >= 0 && X + j < EPD_WIDTH && Y + i >= 0 && Y + i < EPD_HEIGHT)
                {
                    byteIndex = (X + j) / 8;
                    bitIndex = 7 - ((X + j) % 8);
                    
                    if(temp & (0x80 >> j))  // 如果该位为1（表示要显示的点）
                    {
                        /* 设置为黑色（0） */
                        EPD_DisplayBuf[Y + i][byteIndex] &= ~(0x01 << bitIndex);
                    }
                    else
                    {
                        /* 设置为白色（1） */
                        EPD_DisplayBuf[Y + i][byteIndex] |= (0x01 << bitIndex);
                    }
                }
            }
        }
    }
    else if(FontSize == EPD_6X8)
    {
        /* 6x8字体，每个字符6字节，每字节代表一列8个像素？还是每字节代表一行？ */
        /* 根据常见6x8字库格式，通常是每字节代表一列8个像素 */
        pos = Char - ' ';  // 计算字符在字库中的位置
        
        for(j = 0; j < 6; j++)  // 6列（宽度）
        {
            temp = EPD_F6x8[pos][j];  // 获取一列数据
            
            for(i = 0; i < 8; i++)  // 8行（高度）
            {
                if(X + j >= 0 && X + j < EPD_WIDTH && Y + i >= 0 && Y + i < EPD_HEIGHT)
                {
                    byteIndex = (X + j) / 8;
                    bitIndex = 7 - ((X + j) % 8);
                    
                    if(temp & (1 << i))  // 检查该行是否有像素
                    {
                        /* 设置为黑色（0） */
                        EPD_DisplayBuf[Y + i][byteIndex] &= ~(0x01 << bitIndex);
                    }
                    else
                    {
                        /* 设置为白色（1） */
                        EPD_DisplayBuf[Y + i][byteIndex] |= (0x01 << bitIndex);
                    }
                }
            }
        }
    }
}

void EPD_ShowString(int16_t X, int16_t Y, char *String, uint8_t FontSize)
{
    uint16_t XOffset = 0;
    
    while(*String != '\0')
    {
        EPD_ShowChar(X + XOffset, Y, *String, FontSize);
        XOffset += FontSize;
        String++;
    }
}

void EPD_ShowNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
    uint8_t i;
    for(i = 0; i < Length; i++)
    {
        EPD_ShowChar(X + i * FontSize, Y, 
                     Number / EPD_Pow(10, Length - i - 1) % 10 + '0', FontSize);
    }
}

void EPD_ShowSignedNum(int16_t X, int16_t Y, int32_t Number, uint8_t Length, uint8_t FontSize)
{
    uint8_t i;
    uint32_t Number1;
    
    if(Number >= 0)
    {
        EPD_ShowChar(X, Y, '+', FontSize);
        Number1 = Number;
    }
    else
    {
        EPD_ShowChar(X, Y, '-', FontSize);
        Number1 = -Number;
    }
    
    for(i = 0; i < Length; i++)
    {
        EPD_ShowChar(X + (i + 1) * FontSize, Y, 
                     Number1 / EPD_Pow(10, Length - i - 1) % 10 + '0', FontSize);
    }
}

void EPD_ShowHexNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
    uint8_t i, SingleNumber;
    for(i = 0; i < Length; i++)
    {
        SingleNumber = Number / EPD_Pow(16, Length - i - 1) % 16;
        
        if(SingleNumber < 10)
        {
            EPD_ShowChar(X + i * FontSize, Y, SingleNumber + '0', FontSize);
        }
        else
        {
            EPD_ShowChar(X + i * FontSize, Y, SingleNumber - 10 + 'A', FontSize);
        }
    }
}

void EPD_ShowBinNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
    uint8_t i;
    for(i = 0; i < Length; i++)
    {
        EPD_ShowChar(X + i * FontSize, Y, 
                     Number / EPD_Pow(2, Length - i - 1) % 2 + '0', FontSize);
    }
}

void EPD_ShowFloatNum(int16_t X, int16_t Y, double Number, uint8_t IntLength, uint8_t FraLength, uint8_t FontSize)
{
    uint32_t PowNum, IntNum, FraNum;
    
    if(Number >= 0)
    {
        EPD_ShowChar(X, Y, '+', FontSize);
    }
    else
    {
        EPD_ShowChar(X, Y, '-', FontSize);
        Number = -Number;
    }
    
    IntNum = Number;
    Number -= IntNum;
    PowNum = EPD_Pow(10, FraLength);
    FraNum = round(Number * PowNum);
    IntNum += FraNum / PowNum;
    
    EPD_ShowNum(X + FontSize, Y, IntNum, IntLength, FontSize);
    EPD_ShowChar(X + (IntLength + 1) * FontSize, Y, '.', FontSize);
    EPD_ShowNum(X + (IntLength + 2) * FontSize, Y, FraNum, FraLength, FontSize);
}

/**
  * 函    数：EPD显示图像
  * 参    数：X 指定图像左上角的横坐标
  * 参    数：Y 指定图像左上角的纵坐标
  * 参    数：Width 指定图像的宽度
  * 参    数：Height 指定图像的高度
  * 参    数：Image 指定要显示的图像
  * 返 回 值：无
  * 注：图像数据中1表示黑色，0表示白色
  */
void EPD_ShowImage(int16_t X, int16_t Y, uint8_t Width, uint8_t Height, const uint8_t *Image)
{
    uint16_t i, j;
    uint8_t byteIndex, bitIndex;
    uint8_t pixel;
    uint16_t bytesPerLine;
    
    /* 计算每行需要的字节数 */
    bytesPerLine = (Width + 7) / 8;
    
    /* 先清空显示区域（设置为白色）*/
    for(j = 0; j < Height; j++)
    {
        for(i = 0; i < Width; i++)
        {
            if(X + i >= 0 && X + i < EPD_WIDTH && Y + j >= 0 && Y + j < EPD_HEIGHT)
            {
                byteIndex = (X + i) / 8;
                bitIndex = 7 - ((X + i) % 8);
                EPD_DisplayBuf[Y + j][byteIndex] |= (0x01 << bitIndex);  // 设置为1（白色）
            }
        }
    }
    
    /* 绘制图像 */
    for(j = 0; j < Height; j++)
    {
        for(i = 0; i < Width; i++)
        {
            if(X + i >= 0 && X + i < EPD_WIDTH && Y + j >= 0 && Y + j < EPD_HEIGHT)
            {
                byteIndex = (X + i) / 8;
                bitIndex = 7 - ((X + i) % 8);
                
                /* 读取图像数据中的像素 */
                pixel = (Image[j * bytesPerLine + i / 8] >> (7 - (i % 8))) & 0x01;
                
                if(pixel)
                {
                    /* 1表示黑色，设置为0 */
                    EPD_DisplayBuf[Y + j][byteIndex] &= ~(0x01 << bitIndex);
                }
                /* 如果是0（白色），已经是白色状态，不需要操作 */
            }
        }
    }
}

