foxbrokenleaf/ESP32-edp/Project/STM32F10x_StdPeriph_Template/MDK-ARM/Drivers/EPD.c
void EPD_Printf(int16_t X, int16_t Y, uint8_t FontSize, char *format, ...)
{
    char String[256];
    va_list arg;
    va_start(arg, format);
    vsprintf(String, format, arg);
    va_end(arg);
    EPD_ShowString(X, Y, String, FontSize);
}

/**
  * 函    数：EPD在指定位置画一个点（黑色）
  * 参    数：X 指定点的横坐标
  * 参    数：Y 指定点的纵坐标
  * 返 回 值：无
  * 注：0表示黑色，1表示白色
  */
void EPD_DrawPoint(int16_t X, int16_t Y)
{
    uint8_t byteIndex, bitIndex;
    
    if(X >= 0 && X < EPD_WIDTH && Y >= 0 && Y < EPD_HEIGHT)
    {
        byteIndex = X / 8;
        bitIndex = 7 - (X % 8);
        EPD_DisplayBuf[Y][byteIndex] &= ~(0x01 << bitIndex);  // 设置为0（黑色）
    }
}

/**
  * 函    数：EPD擦除指定位置的点（设置为白色）
  * 参    数：X 指定点的横坐标
  * 参    数：Y 指定点的纵坐标
  * 返 回 值：无
  */
void EPD_ClearPoint(int16_t X, int16_t Y)
{
    uint8_t byteIndex, bitIndex;
    
    if(X >= 0 && X < EPD_WIDTH && Y >= 0 && Y < EPD_HEIGHT)
    {
        byteIndex = X / 8;
        bitIndex = 7 - (X % 8);
        EPD_DisplayBuf[Y][byteIndex] |= (0x01 << bitIndex);  // 设置为1（白色）
    }
}

uint8_t EPD_GetPoint(int16_t X, int16_t Y)
{
    uint8_t byteIndex, bitIndex;
    
    if(X >= 0 && X < EPD_WIDTH && Y >= 0 && Y < EPD_HEIGHT)
    {
        byteIndex = X / 8;
        bitIndex = 7 - (X % 8);
        if(EPD_DisplayBuf[Y][byteIndex] & (0x01 << bitIndex))
        {
            return 1;
        }
    }
    return 0;
}

void EPD_DrawLine(int16_t X0, int16_t Y0, int16_t X1, int16_t Y1)
{
    int16_t x, y, dx, dy, d, incrE, incrNE, temp;
    int16_t x0 = X0, y0 = Y0, x1 = X1, y1 = Y1;
    uint8_t yflag = 0, xyflag = 0;
    
    if(y0 == y1)
    {
        if(x0 > x1) {temp = x0; x0 = x1; x1 = temp;}
        for(x = x0; x <= x1; x++)
        {
            EPD_DrawPoint(x, y0);
        }
    }
    else if(x0 == x1)
    {
        if(y0 > y1) {temp = y0; y0 = y1; y1 = temp;}
        for(y = y0; y <= y1; y++)
        {
            EPD_DrawPoint(x0, y);
        }
    }
    else
    {
        if(x0 > x1)
        {
            temp = x0; x0 = x1; x1 = temp;
            temp = y0; y0 = y1; y1 = temp;
        }
        
        if(y0 > y1)
        {
            y0 = -y0;
            y1 = -y1;
            yflag = 1;
        }
        
        if(y1 - y0 > x1 - x0)
        {
            temp = x0; x0 = y0; y0 = temp;
            temp = x1; x1 = y1; y1 = temp;
            xyflag = 1;
        }
        
        dx = x1 - x0;
        dy = y1 - y0;
        incrE = 2 * dy;
        incrNE = 2 * (dy - dx);
        d = 2 * dy - dx;
        x = x0;
        y = y0;
        
        if(yflag && xyflag){EPD_DrawPoint(y, -x);}
        else if(yflag)     {EPD_DrawPoint(x, -y);}
        else if(xyflag)    {EPD_DrawPoint(y, x);}
        else               {EPD_DrawPoint(x, y);}
        
        while(x < x1)
        {
            x++;
            if(d < 0)
            {
                d += incrE;
            }
            else
            {
                y++;
                d += incrNE;
            }
            
            if(yflag && xyflag){EPD_DrawPoint(y, -x);}
            else if(yflag)     {EPD_DrawPoint(x, -y);}
            else if(xyflag)    {EPD_DrawPoint(y, x);}
            else               {EPD_DrawPoint(x, y);}
        }
    }
}

void EPD_DrawDashedLine(int16_t X0, int16_t Y0, int16_t X1, int16_t Y1)
{
    const uint8_t dashLength = 3;
    const uint8_t gapLength = 2;
    
    int16_t x, y, dx, dy, d, incrE, incrNE, temp;
    int16_t x0 = X0, y0 = Y0, x1 = X1, y1 = Y1;
    uint8_t yflag = 0, xyflag = 0;
    uint16_t pointCount = 0;
    
    if(y0 == y1)
    {
        if(x0 > x1) {temp = x0; x0 = x1; x1 = temp;}
        
        for(x = x0; x <= x1; x++)
        {
            if(pointCount < dashLength)
            {
                EPD_DrawPoint(x, y0);
            }
            pointCount = (pointCount + 1) % (dashLength + gapLength);
        }
    }
    else if(x0 == x1)
    {
        if(y0 > y1) {temp = y0; y0 = y1; y1 = temp;}
        
        for(y = y0; y <= y1; y++)
        {
            if(pointCount < dashLength)
            {
                EPD_DrawPoint(x0, y);
            }
            pointCount = (pointCount + 1) % (dashLength + gapLength);
        }
    }
    else
    {
        if(x0 > x1)
        {
            temp = x0; x0 = x1; x1 = temp;
            temp = y0; y0 = y1; y1 = temp;
        }
        
        if(y0 > y1)
        {
            y0 = -y0;
            y1 = -y1;
            yflag = 1;
        }
        
        if(y1 - y0 > x1 - x0)
        {
            temp = x0; x0 = y0; y0 = temp;
            temp = x1; x1 = y1; y1 = temp;
            xyflag = 1;
        }
        
        dx = x1 - x0;
        dy = y1 - y0;
        incrE = 2 * dy;
        incrNE = 2 * (dy - dx);
        d = 2 * dy - dx;
        x = x0;
        y = y0;
        
        if(pointCount < dashLength)
        {
            if(yflag && xyflag){EPD_DrawPoint(y, -x);}
            else if(yflag)     {EPD_DrawPoint(x, -y);}
            else if(xyflag)    {EPD_DrawPoint(y, x);}
            else               {EPD_DrawPoint(x, y);}
        }
        pointCount = (pointCount + 1) % (dashLength + gapLength);
        
        while(x < x1)
        {
            x++;
            if(d < 0)
            {
                d += incrE;
            }
            else
            {
                y++;
                d += incrNE;
            }
            
            if(pointCount < dashLength)
            {
                if(yflag && xyflag){EPD_DrawPoint(y, -x);}
                else if(yflag)     {EPD_DrawPoint(x, -y);}
                else if(xyflag)    {EPD_DrawPoint(y, x);}
                else               {EPD_DrawPoint(x, y);}
            }
            pointCount = (pointCount + 1) % (dashLength + gapLength);
        }
    }
}

void EPD_DrawRectangle(int16_t X, int16_t Y, uint16_t Width, uint16_t Height, uint8_t IsFilled)
{
    int16_t i, j;
    
    if(!IsFilled)
    {
        for(i = X; i < X + Width; i++)
        {
            EPD_DrawPoint(i, Y);
            EPD_DrawPoint(i, Y + Height - 1);
        }
        for(i = Y; i < Y + Height; i++)
        {
            EPD_DrawPoint(X, i);
            EPD_DrawPoint(X + Width - 1, i);
        }
    }
    else
    {
        for(i = X; i < X + Width; i++)
        {
            for(j = Y; j < Y + Height; j++)
            {
                EPD_DrawPoint(i, j);
            }
        }
    }
}

void EPD_DrawTriangle(int16_t X0, int16_t Y0, int16_t X1, int16_t Y1, 
                      int16_t X2, int16_t Y2, uint8_t IsFilled)
{
    int16_t minx = X0, miny = Y0, maxx = X0, maxy = Y0;
    int16_t i, j;
    int16_t vx[] = {X0, X1, X2};
    int16_t vy[] = {Y0, Y1, Y2};
    
    if(!IsFilled)
    {
        EPD_DrawLine(X0, Y0, X1, Y1);
        EPD_DrawLine(X0, Y0, X2, Y2);
        EPD_DrawLine(X1, Y1, X2, Y2);
    }
    else
    {
        if(X1 < minx) {minx = X1;}
        if(X2 < minx) {minx = X2;}
        if(Y1 < miny) {miny = Y1;}
        if(Y2 < miny) {miny = Y2;}
        
