foxbrokenleaf/ESP32-edp/Project/STM32F10x_StdPeriph_Template/MDK-ARM/Drivers/EPD.c
        if(X1 > maxx) {maxx = X1;}
        if(X2 > maxx) {maxx = X2;}
        if(Y1 > maxy) {maxy = Y1;}
        if(Y2 > maxy) {maxy = Y2;}
        
        for(i = minx; i <= maxx; i++)
        {
            for(j = miny; j <= maxy; j++)
            {
                if(EPD_pnpoly(3, vx, vy, i, j))
                {
                    EPD_DrawPoint(i, j);
                }
            }
        }
    }
}

void EPD_DrawCircle(int16_t X, int16_t Y, uint16_t Radius, uint8_t IsFilled)
{
    int16_t x, y, d, j;
    
    d = 1 - Radius;
    x = 0;
    y = Radius;
    
    EPD_DrawPoint(X + x, Y + y);
    EPD_DrawPoint(X - x, Y - y);
    EPD_DrawPoint(X + y, Y + x);
    EPD_DrawPoint(X - y, Y - x);
    
    if(IsFilled)
    {
        for(j = -y; j < y; j++)
        {
            EPD_DrawPoint(X, Y + j);
        }
    }
    
    while(x < y)
    {
        x++;
        if(d < 0)
        {
            d += 2 * x + 1;
        }
        else
        {
            y--;
            d += 2 * (x - y) + 1;
        }
        
        EPD_DrawPoint(X + x, Y + y);
        EPD_DrawPoint(X + y, Y + x);
        EPD_DrawPoint(X - x, Y - y);
        EPD_DrawPoint(X - y, Y - x);
        EPD_DrawPoint(X + x, Y - y);
        EPD_DrawPoint(X + y, Y - x);
        EPD_DrawPoint(X - x, Y + y);
        EPD_DrawPoint(X - y, Y + x);
        
        if(IsFilled)
        {
            for(j = -y; j < y; j++)
            {
                EPD_DrawPoint(X + x, Y + j);
                EPD_DrawPoint(X - x, Y + j);
            }
            for(j = -x; j < x; j++)
            {
                EPD_DrawPoint(X - y, Y + j);
                EPD_DrawPoint(X + y, Y + j);
            }
        }
    }
}

void EPD_DrawArc(int16_t X, int16_t Y, uint8_t Radius, int16_t StartAngle, int16_t EndAngle, uint8_t IsFilled)
{
    int16_t x, y, d, j;
    
    d = 1 - Radius;
    x = 0;
    y = Radius;
    
    if(EPD_IsInAngle(x, y, StartAngle, EndAngle)) {EPD_DrawPoint(X + x, Y + y);}
    if(EPD_IsInAngle(-x, -y, StartAngle, EndAngle)) {EPD_DrawPoint(X - x, Y - y);}
    if(EPD_IsInAngle(y, x, StartAngle, EndAngle)) {EPD_DrawPoint(X + y, Y + x);}
    if(EPD_IsInAngle(-y, -x, StartAngle, EndAngle)) {EPD_DrawPoint(X - y, Y - x);}
    
    if(IsFilled)
    {
        for(j = -y; j < y; j++)
        {
            if(EPD_IsInAngle(0, j, StartAngle, EndAngle)) {EPD_DrawPoint(X, Y + j);}
        }
    }
    
    while(x < y)
    {
        x++;
        if(d < 0)
        {
            d += 2 * x + 1;
        }
        else
        {
            y--;
            d += 2 * (x - y) + 1;
        }
        
        if(EPD_IsInAngle(x, y, StartAngle, EndAngle)) {EPD_DrawPoint(X + x, Y + y);}
        if(EPD_IsInAngle(y, x, StartAngle, EndAngle)) {EPD_DrawPoint(X + y, Y + x);}
        if(EPD_IsInAngle(-x, -y, StartAngle, EndAngle)) {EPD_DrawPoint(X - x, Y - y);}
        if(EPD_IsInAngle(-y, -x, StartAngle, EndAngle)) {EPD_DrawPoint(X - y, Y - x);}
        if(EPD_IsInAngle(x, -y, StartAngle, EndAngle)) {EPD_DrawPoint(X + x, Y - y);}
        if(EPD_IsInAngle(y, -x, StartAngle, EndAngle)) {EPD_DrawPoint(X + y, Y - x);}
        if(EPD_IsInAngle(-x, y, StartAngle, EndAngle)) {EPD_DrawPoint(X - x, Y + y);}
        if(EPD_IsInAngle(-y, x, StartAngle, EndAngle)) {EPD_DrawPoint(X - y, Y + x);}
        
        if(IsFilled)
        {
            for(j = -y; j < y; j++)
            {
                if(EPD_IsInAngle(x, j, StartAngle, EndAngle)) {EPD_DrawPoint(X + x, Y + j);}
                if(EPD_IsInAngle(-x, j, StartAngle, EndAngle)) {EPD_DrawPoint(X - x, Y + j);}
            }
            for(j = -x; j < x; j++)
            {
                if(EPD_IsInAngle(-y, j, StartAngle, EndAngle)) {EPD_DrawPoint(X - y, Y + j);}
                if(EPD_IsInAngle(y, j, StartAngle, EndAngle)) {EPD_DrawPoint(X + y, Y + j);}
            }
        }
    }
}